# Arc Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Arc Class
Members See Also
---
A circular arc.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Arc : Curve
```

Visual Basic
---
```text
Public Class Arc _
	Inherits Curve
```

Visual C++
---
```text
public ref class Arc : public Curve
```

# Remarks
The arc lies in the plane defined by center and normal.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..Curve Autodesk.Revit.DB..::..Arc
# See Also
Arc Members
Autodesk.Revit.DB Namespace